### SQLite in Python

In [1]:
import sqlite3
conn = sqlite3.connect('example.db')

In [2]:
c = conn.cursor()

### Create

In [4]:
c.execute('CREATE TABLE person(name text, address text)')
conn.commit()

OperationalError: table person already exists

In [5]:
c.execute("SELECT * FROM sqlite_master where type='table'")
c.fetchall()

[('table',
  'person',
  'person',
  2,
  'CREATE TABLE "person" (\n"ID" INTEGER,\n  "Name" TEXT,\n  "Address" TEXT\n)')]

### Insert

In [6]:
c.execute("INSERT INTO person VALUES ('Anna Hery', 'Carlow')")
conn.commit()

OperationalError: table person has 3 columns but 2 values were supplied

In [7]:
c.execute("SELECT * FROM person")
c.fetchall()

[(0, 'Anna Henry', 'Carlow'),
 (1, 'Shelby Beck', 'Tipperary'),
 (2, 'Marie Carr', 'Kerry'),
 (3, 'Sarah Heath', 'Monaghan'),
 (4, 'Robert Snyder', 'Leitrim'),
 (5, 'Lucas Ross', 'Cork'),
 (6, 'David Cox', 'Leitrim'),
 (7, 'Jackson Dean', 'Louth'),
 (8, 'Elizabeth Mcfarland', 'Dublin'),
 (9, 'Timothy Cummings', 'Limerick'),
 (10, 'Jennifer Reeves', 'Offaly'),
 (11, 'Sandra Knight', 'Offaly'),
 (12, 'Karen Roach', 'Sligo'),
 (13, 'Megan Clarke', 'Kildare'),
 (14, 'Hannah Collier', 'Leitrim'),
 (15, 'Crystal Murphy', 'Clare'),
 (16, 'Jacob Moore', 'Longford'),
 (17, 'Valerie Stewart', 'Longford'),
 (18, 'Mrs. Kerry Romero', 'Limerick'),
 (19, 'Richard Foley', 'Offaly'),
 (20, 'Billy King', 'Louth'),
 (21, 'Christopher Mcmahon', 'Limerick'),
 (22, 'Gregory Vazquez', 'Sligo'),
 (23, 'George Fitzgerald', 'Carlow'),
 (24, 'Joshua Perez', 'Galway'),
 (25, 'Leonard Brown', 'Sligo'),
 (26, 'Anne Anderson', 'Cork'),
 (27, 'Marc Chapman', 'Dublin'),
 (28, 'Connie Walls', 'Limerick'),
 (29, 'Seth Simpson', 'Westmeath'),
 (30, 'Laura Miller', 'Louth'),
 (31, 'William Hall', 'Kerry'),
 (32, 'Katherine Dalton', 'Kildare'),
 (33, 'Alan Williams', 'Galway'),
 (34, 'Diane Hunt', 'Westmeath'),
 (35, 'Lauren Long', 'Louth'),
 (36, 'James Williams', 'Kilkenny'),
 (37, 'Jeremiah Soto', 'Sligo'),
 (38, 'Gregory Charles', 'Wicklow'),
 (39, 'Raymond Gould', 'Clare'),
 (40, 'Susan Cummings', 'Cork'),
 (41, 'Megan Reyes', 'Offaly'),
 (42, 'Devin Shaw', 'Wexford'),
 (43, 'Kathleen Henderson', 'Monaghan'),
 (44, 'John Davis', 'Dublin'),
 (45, 'Melanie White', 'Carlow'),
 (46, 'Kerry Curry', 'Galway'),
 (47, 'Nathan Smith', 'Roscommon'),
 (48, 'Sara Lee', 'Laois'),
 (49, 'Valerie Rodriguez', 'Kerry'),
 (50, 'Raymond Perkins', 'Clare'),
 (51, 'David Matthews', 'Leitrim'),
 (52, 'Lori Harmon', 'Carlow'),
 (53, 'Kayla Rodriguez DVM', 'Clare'),
 (54, 'Alan Cabrera', 'Leitrim'),
 (55, 'Elizabeth Harper', 'Donegal'),
 (56, 'Glenn Gonzalez', 'Leitrim'),
 (57, 'Robert Price', 'Dublin'),
 (58, 'Tina Holland', 'Sligo'),
 (59, 'Melinda Blackwell', 'Mayo'),
 (60, 'Christina Bautista', 'Longford'),
 (61, 'Scott Whitaker', 'Offaly'),
 (62, 'Jeff Stevens', 'Dublin'),
 (63, 'Robert Acevedo', 'Meath'),
 (64, 'Tracey Olson', 'Kilkenny'),
 (65, 'James Walker', 'Tipperary'),
 (66, 'Jennifer Sutton', 'Mayo'),
 (67, 'Nicholas Carrillo', 'Laois'),
 (68, 'Emily Cooper', 'Kildare'),
 (69, 'Sabrina Thompson', 'Longford'),
 (70, 'Jenny Juarez', 'Longford'),
 (71, 'Melissa Lowe', 'Westmeath'),
 (72, 'Jesse Chavez', 'Meath'),
 (73, 'Kelly Walker', 'Kildare'),
 (74, 'Leonard Chen', 'Galway'),
 (75, 'Peter Vaughn DDS', 'Cork'),
 (76, 'Justin Casey', 'Louth'),
 (77, 'Shannon Oneal', 'Sligo'),
 (78, 'Robert Fields', 'Louth'),
 (79, 'Marcus Malone', 'Kildare'),
 (80, 'Paul Nicholson', 'Wexford'),
 (81, 'Jared Nguyen', 'Cavan'),
 (82, 'Mrs. Sheila Wilkerson', 'Tipperary'),
 (83, 'Emily Alvarado', 'Longford'),
 (84, 'Christopher Miller', 'Kerry'),
 (85, 'Carrie Sullivan', 'Galway'),
 (86, 'Jordan Velasquez', 'Galway'),
 (87, 'Melissa Bell', 'Kildare'),
 (88, 'Frederick Schwartz', 'Dublin'),
 (89, 'Stephanie Yates', 'Meath'),
 (90, 'Lori Martin', 'Westmeath'),
 (91, 'Donna Mason', 'Longford'),
 (92, 'Rachel Johnson', 'Kildare'),
 (93, 'Morgan Marsh', 'Westmeath'),
 (94, 'Daniel Smith', 'Limerick'),
 (95, 'Joseph Griffith', 'Wicklow'),
 (96, 'Stephen Oneal', 'Louth'),
 (97, 'Dana Wade', 'Mayo'),
 (98, 'Gail Jones', 'Waterford'),
 (99, 'Paul Raymond', 'Louth')]

### Insert Many

In [8]:
person = [('Shelby Beck', 'Tipperary'), ('Marie Carr', 'Kerry'),('Sarah Heath', 'Monaghan')]

In [9]:
person

[('Shelby Beck', 'Tipperary'),
 ('Marie Carr', 'Kerry'),
 ('Sarah Heath', 'Monaghan')]

In [10]:
c.executemany("INSERT INTO person VALUES (?, ?)", person)
conn.commit()

OperationalError: table person has 3 columns but 2 values were supplied

In [11]:
c.execute("SELECT * FROM person")
c.fetchall()

[(0, 'Anna Henry', 'Carlow'),
 (1, 'Shelby Beck', 'Tipperary'),
 (2, 'Marie Carr', 'Kerry'),
 (3, 'Sarah Heath', 'Monaghan'),
 (4, 'Robert Snyder', 'Leitrim'),
 (5, 'Lucas Ross', 'Cork'),
 (6, 'David Cox', 'Leitrim'),
 (7, 'Jackson Dean', 'Louth'),
 (8, 'Elizabeth Mcfarland', 'Dublin'),
 (9, 'Timothy Cummings', 'Limerick'),
 (10, 'Jennifer Reeves', 'Offaly'),
 (11, 'Sandra Knight', 'Offaly'),
 (12, 'Karen Roach', 'Sligo'),
 (13, 'Megan Clarke', 'Kildare'),
 (14, 'Hannah Collier', 'Leitrim'),
 (15, 'Crystal Murphy', 'Clare'),
 (16, 'Jacob Moore', 'Longford'),
 (17, 'Valerie Stewart', 'Longford'),
 (18, 'Mrs. Kerry Romero', 'Limerick'),
 (19, 'Richard Foley', 'Offaly'),
 (20, 'Billy King', 'Louth'),
 (21, 'Christopher Mcmahon', 'Limerick'),
 (22, 'Gregory Vazquez', 'Sligo'),
 (23, 'George Fitzgerald', 'Carlow'),
 (24, 'Joshua Perez', 'Galway'),
 (25, 'Leonard Brown', 'Sligo'),
 (26, 'Anne Anderson', 'Cork'),
 (27, 'Marc Chapman', 'Dublin'),
 (28, 'Connie Walls', 'Limerick'),
 (29, 'Seth Simpson', 'Westmeath'),
 (30, 'Laura Miller', 'Louth'),
 (31, 'William Hall', 'Kerry'),
 (32, 'Katherine Dalton', 'Kildare'),
 (33, 'Alan Williams', 'Galway'),
 (34, 'Diane Hunt', 'Westmeath'),
 (35, 'Lauren Long', 'Louth'),
 (36, 'James Williams', 'Kilkenny'),
 (37, 'Jeremiah Soto', 'Sligo'),
 (38, 'Gregory Charles', 'Wicklow'),
 (39, 'Raymond Gould', 'Clare'),
 (40, 'Susan Cummings', 'Cork'),
 (41, 'Megan Reyes', 'Offaly'),
 (42, 'Devin Shaw', 'Wexford'),
 (43, 'Kathleen Henderson', 'Monaghan'),
 (44, 'John Davis', 'Dublin'),
 (45, 'Melanie White', 'Carlow'),
 (46, 'Kerry Curry', 'Galway'),
 (47, 'Nathan Smith', 'Roscommon'),
 (48, 'Sara Lee', 'Laois'),
 (49, 'Valerie Rodriguez', 'Kerry'),
 (50, 'Raymond Perkins', 'Clare'),
 (51, 'David Matthews', 'Leitrim'),
 (52, 'Lori Harmon', 'Carlow'),
 (53, 'Kayla Rodriguez DVM', 'Clare'),
 (54, 'Alan Cabrera', 'Leitrim'),
 (55, 'Elizabeth Harper', 'Donegal'),
 (56, 'Glenn Gonzalez', 'Leitrim'),
 (57, 'Robert Price', 'Dublin'),
 (58, 'Tina Holland', 'Sligo'),
 (59, 'Melinda Blackwell', 'Mayo'),
 (60, 'Christina Bautista', 'Longford'),
 (61, 'Scott Whitaker', 'Offaly'),
 (62, 'Jeff Stevens', 'Dublin'),
 (63, 'Robert Acevedo', 'Meath'),
 (64, 'Tracey Olson', 'Kilkenny'),
 (65, 'James Walker', 'Tipperary'),
 (66, 'Jennifer Sutton', 'Mayo'),
 (67, 'Nicholas Carrillo', 'Laois'),
 (68, 'Emily Cooper', 'Kildare'),
 (69, 'Sabrina Thompson', 'Longford'),
 (70, 'Jenny Juarez', 'Longford'),
 (71, 'Melissa Lowe', 'Westmeath'),
 (72, 'Jesse Chavez', 'Meath'),
 (73, 'Kelly Walker', 'Kildare'),
 (74, 'Leonard Chen', 'Galway'),
 (75, 'Peter Vaughn DDS', 'Cork'),
 (76, 'Justin Casey', 'Louth'),
 (77, 'Shannon Oneal', 'Sligo'),
 (78, 'Robert Fields', 'Louth'),
 (79, 'Marcus Malone', 'Kildare'),
 (80, 'Paul Nicholson', 'Wexford'),
 (81, 'Jared Nguyen', 'Cavan'),
 (82, 'Mrs. Sheila Wilkerson', 'Tipperary'),
 (83, 'Emily Alvarado', 'Longford'),
 (84, 'Christopher Miller', 'Kerry'),
 (85, 'Carrie Sullivan', 'Galway'),
 (86, 'Jordan Velasquez', 'Galway'),
 (87, 'Melissa Bell', 'Kildare'),
 (88, 'Frederick Schwartz', 'Dublin'),
 (89, 'Stephanie Yates', 'Meath'),
 (90, 'Lori Martin', 'Westmeath'),
 (91, 'Donna Mason', 'Longford'),
 (92, 'Rachel Johnson', 'Kildare'),
 (93, 'Morgan Marsh', 'Westmeath'),
 (94, 'Daniel Smith', 'Limerick'),
 (95, 'Joseph Griffith', 'Wicklow'),
 (96, 'Stephen Oneal', 'Louth'),
 (97, 'Dana Wade', 'Mayo'),
 (98, 'Gail Jones', 'Waterford'),
 (99, 'Paul Raymond', 'Louth')]

In [12]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(1, 'Anna Henry', 'Carlow'),
 (2, 'Shelby Beck', 'Tipperary'),
 (3, 'Marie Carr', 'Kerry'),
 (4, 'Sarah Heath', 'Monaghan'),
 (5, 'Robert Snyder', 'Leitrim'),
 (6, 'Lucas Ross', 'Cork'),
 (7, 'David Cox', 'Leitrim'),
 (8, 'Jackson Dean', 'Louth'),
 (9, 'Elizabeth Mcfarland', 'Dublin'),
 (10, 'Timothy Cummings', 'Limerick'),
 (11, 'Jennifer Reeves', 'Offaly'),
 (12, 'Sandra Knight', 'Offaly'),
 (13, 'Karen Roach', 'Sligo'),
 (14, 'Megan Clarke', 'Kildare'),
 (15, 'Hannah Collier', 'Leitrim'),
 (16, 'Crystal Murphy', 'Clare'),
 (17, 'Jacob Moore', 'Longford'),
 (18, 'Valerie Stewart', 'Longford'),
 (19, 'Mrs. Kerry Romero', 'Limerick'),
 (20, 'Richard Foley', 'Offaly'),
 (21, 'Billy King', 'Louth'),
 (22, 'Christopher Mcmahon', 'Limerick'),
 (23, 'Gregory Vazquez', 'Sligo'),
 (24, 'George Fitzgerald', 'Carlow'),
 (25, 'Joshua Perez', 'Galway'),
 (26, 'Leonard Brown', 'Sligo'),
 (27, 'Anne Anderson', 'Cork'),
 (28, 'Marc Chapman', 'Dublin'),
 (29, 'Connie Walls', 'Limerick'),
 (30, 'Seth Simpson', 'Westmeath'),
 (31, 'Laura Miller', 'Louth'),
 (32, 'William Hall', 'Kerry'),
 (33, 'Katherine Dalton', 'Kildare'),
 (34, 'Alan Williams', 'Galway'),
 (35, 'Diane Hunt', 'Westmeath'),
 (36, 'Lauren Long', 'Louth'),
 (37, 'James Williams', 'Kilkenny'),
 (38, 'Jeremiah Soto', 'Sligo'),
 (39, 'Gregory Charles', 'Wicklow'),
 (40, 'Raymond Gould', 'Clare'),
 (41, 'Susan Cummings', 'Cork'),
 (42, 'Megan Reyes', 'Offaly'),
 (43, 'Devin Shaw', 'Wexford'),
 (44, 'Kathleen Henderson', 'Monaghan'),
 (45, 'John Davis', 'Dublin'),
 (46, 'Melanie White', 'Carlow'),
 (47, 'Kerry Curry', 'Galway'),
 (48, 'Nathan Smith', 'Roscommon'),
 (49, 'Sara Lee', 'Laois'),
 (50, 'Valerie Rodriguez', 'Kerry'),
 (51, 'Raymond Perkins', 'Clare'),
 (52, 'David Matthews', 'Leitrim'),
 (53, 'Lori Harmon', 'Carlow'),
 (54, 'Kayla Rodriguez DVM', 'Clare'),
 (55, 'Alan Cabrera', 'Leitrim'),
 (56, 'Elizabeth Harper', 'Donegal'),
 (57, 'Glenn Gonzalez', 'Leitrim'),
 (58, 'Robert Price', 'Dublin'),
 (59, 'Tina Holland', 'Sligo'),
 (60, 'Melinda Blackwell', 'Mayo'),
 (61, 'Christina Bautista', 'Longford'),
 (62, 'Scott Whitaker', 'Offaly'),
 (63, 'Jeff Stevens', 'Dublin'),
 (64, 'Robert Acevedo', 'Meath'),
 (65, 'Tracey Olson', 'Kilkenny'),
 (66, 'James Walker', 'Tipperary'),
 (67, 'Jennifer Sutton', 'Mayo'),
 (68, 'Nicholas Carrillo', 'Laois'),
 (69, 'Emily Cooper', 'Kildare'),
 (70, 'Sabrina Thompson', 'Longford'),
 (71, 'Jenny Juarez', 'Longford'),
 (72, 'Melissa Lowe', 'Westmeath'),
 (73, 'Jesse Chavez', 'Meath'),
 (74, 'Kelly Walker', 'Kildare'),
 (75, 'Leonard Chen', 'Galway'),
 (76, 'Peter Vaughn DDS', 'Cork'),
 (77, 'Justin Casey', 'Louth'),
 (78, 'Shannon Oneal', 'Sligo'),
 (79, 'Robert Fields', 'Louth'),
 (80, 'Marcus Malone', 'Kildare'),
 (81, 'Paul Nicholson', 'Wexford'),
 (82, 'Jared Nguyen', 'Cavan'),
 (83, 'Mrs. Sheila Wilkerson', 'Tipperary'),
 (84, 'Emily Alvarado', 'Longford'),
 (85, 'Christopher Miller', 'Kerry'),
 (86, 'Carrie Sullivan', 'Galway'),
 (87, 'Jordan Velasquez', 'Galway'),
 (88, 'Melissa Bell', 'Kildare'),
 (89, 'Frederick Schwartz', 'Dublin'),
 (90, 'Stephanie Yates', 'Meath'),
 (91, 'Lori Martin', 'Westmeath'),
 (92, 'Donna Mason', 'Longford'),
 (93, 'Rachel Johnson', 'Kildare'),
 (94, 'Morgan Marsh', 'Westmeath'),
 (95, 'Daniel Smith', 'Limerick'),
 (96, 'Joseph Griffith', 'Wicklow'),
 (97, 'Stephen Oneal', 'Louth'),
 (98, 'Dana Wade', 'Mayo'),
 (99, 'Gail Jones', 'Waterford'),
 (100, 'Paul Raymond', 'Louth')]

### Delete

In [13]:
c.execute("DELETE FROM person WHERE ROWID=1")

In [14]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Shelby Beck', 'Tipperary'),
 (3, 'Marie Carr', 'Kerry'),
 (4, 'Sarah Heath', 'Monaghan'),
 (5, 'Robert Snyder', 'Leitrim'),
 (6, 'Lucas Ross', 'Cork'),
 (7, 'David Cox', 'Leitrim'),
 (8, 'Jackson Dean', 'Louth'),
 (9, 'Elizabeth Mcfarland', 'Dublin'),
 (10, 'Timothy Cummings', 'Limerick'),
 (11, 'Jennifer Reeves', 'Offaly'),
 (12, 'Sandra Knight', 'Offaly'),
 (13, 'Karen Roach', 'Sligo'),
 (14, 'Megan Clarke', 'Kildare'),
 (15, 'Hannah Collier', 'Leitrim'),
 (16, 'Crystal Murphy', 'Clare'),
 (17, 'Jacob Moore', 'Longford'),
 (18, 'Valerie Stewart', 'Longford'),
 (19, 'Mrs. Kerry Romero', 'Limerick'),
 (20, 'Richard Foley', 'Offaly'),
 (21, 'Billy King', 'Louth'),
 (22, 'Christopher Mcmahon', 'Limerick'),
 (23, 'Gregory Vazquez', 'Sligo'),
 (24, 'George Fitzgerald', 'Carlow'),
 (25, 'Joshua Perez', 'Galway'),
 (26, 'Leonard Brown', 'Sligo'),
 (27, 'Anne Anderson', 'Cork'),
 (28, 'Marc Chapman', 'Dublin'),
 (29, 'Connie Walls', 'Limerick'),
 (30, 'Seth Simpson', 'Westmeath'),
 (31, 'Laura Miller', 'Louth'),
 (32, 'William Hall', 'Kerry'),
 (33, 'Katherine Dalton', 'Kildare'),
 (34, 'Alan Williams', 'Galway'),
 (35, 'Diane Hunt', 'Westmeath'),
 (36, 'Lauren Long', 'Louth'),
 (37, 'James Williams', 'Kilkenny'),
 (38, 'Jeremiah Soto', 'Sligo'),
 (39, 'Gregory Charles', 'Wicklow'),
 (40, 'Raymond Gould', 'Clare'),
 (41, 'Susan Cummings', 'Cork'),
 (42, 'Megan Reyes', 'Offaly'),
 (43, 'Devin Shaw', 'Wexford'),
 (44, 'Kathleen Henderson', 'Monaghan'),
 (45, 'John Davis', 'Dublin'),
 (46, 'Melanie White', 'Carlow'),
 (47, 'Kerry Curry', 'Galway'),
 (48, 'Nathan Smith', 'Roscommon'),
 (49, 'Sara Lee', 'Laois'),
 (50, 'Valerie Rodriguez', 'Kerry'),
 (51, 'Raymond Perkins', 'Clare'),
 (52, 'David Matthews', 'Leitrim'),
 (53, 'Lori Harmon', 'Carlow'),
 (54, 'Kayla Rodriguez DVM', 'Clare'),
 (55, 'Alan Cabrera', 'Leitrim'),
 (56, 'Elizabeth Harper', 'Donegal'),
 (57, 'Glenn Gonzalez', 'Leitrim'),
 (58, 'Robert Price', 'Dublin'),
 (59, 'Tina Holland', 'Sligo'),
 (60, 'Melinda Blackwell', 'Mayo'),
 (61, 'Christina Bautista', 'Longford'),
 (62, 'Scott Whitaker', 'Offaly'),
 (63, 'Jeff Stevens', 'Dublin'),
 (64, 'Robert Acevedo', 'Meath'),
 (65, 'Tracey Olson', 'Kilkenny'),
 (66, 'James Walker', 'Tipperary'),
 (67, 'Jennifer Sutton', 'Mayo'),
 (68, 'Nicholas Carrillo', 'Laois'),
 (69, 'Emily Cooper', 'Kildare'),
 (70, 'Sabrina Thompson', 'Longford'),
 (71, 'Jenny Juarez', 'Longford'),
 (72, 'Melissa Lowe', 'Westmeath'),
 (73, 'Jesse Chavez', 'Meath'),
 (74, 'Kelly Walker', 'Kildare'),
 (75, 'Leonard Chen', 'Galway'),
 (76, 'Peter Vaughn DDS', 'Cork'),
 (77, 'Justin Casey', 'Louth'),
 (78, 'Shannon Oneal', 'Sligo'),
 (79, 'Robert Fields', 'Louth'),
 (80, 'Marcus Malone', 'Kildare'),
 (81, 'Paul Nicholson', 'Wexford'),
 (82, 'Jared Nguyen', 'Cavan'),
 (83, 'Mrs. Sheila Wilkerson', 'Tipperary'),
 (84, 'Emily Alvarado', 'Longford'),
 (85, 'Christopher Miller', 'Kerry'),
 (86, 'Carrie Sullivan', 'Galway'),
 (87, 'Jordan Velasquez', 'Galway'),
 (88, 'Melissa Bell', 'Kildare'),
 (89, 'Frederick Schwartz', 'Dublin'),
 (90, 'Stephanie Yates', 'Meath'),
 (91, 'Lori Martin', 'Westmeath'),
 (92, 'Donna Mason', 'Longford'),
 (93, 'Rachel Johnson', 'Kildare'),
 (94, 'Morgan Marsh', 'Westmeath'),
 (95, 'Daniel Smith', 'Limerick'),
 (96, 'Joseph Griffith', 'Wicklow'),
 (97, 'Stephen Oneal', 'Louth'),
 (98, 'Dana Wade', 'Mayo'),
 (99, 'Gail Jones', 'Waterford'),
 (100, 'Paul Raymond', 'Louth')]

In [15]:
c.execute("INSERT INTO person VALUES ('Robert Snyder', 'Leitrim')")
conn.commit()

OperationalError: table person has 3 columns but 2 values were supplied

In [16]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Shelby Beck', 'Tipperary'),
 (3, 'Marie Carr', 'Kerry'),
 (4, 'Sarah Heath', 'Monaghan'),
 (5, 'Robert Snyder', 'Leitrim'),
 (6, 'Lucas Ross', 'Cork'),
 (7, 'David Cox', 'Leitrim'),
 (8, 'Jackson Dean', 'Louth'),
 (9, 'Elizabeth Mcfarland', 'Dublin'),
 (10, 'Timothy Cummings', 'Limerick'),
 (11, 'Jennifer Reeves', 'Offaly'),
 (12, 'Sandra Knight', 'Offaly'),
 (13, 'Karen Roach', 'Sligo'),
 (14, 'Megan Clarke', 'Kildare'),
 (15, 'Hannah Collier', 'Leitrim'),
 (16, 'Crystal Murphy', 'Clare'),
 (17, 'Jacob Moore', 'Longford'),
 (18, 'Valerie Stewart', 'Longford'),
 (19, 'Mrs. Kerry Romero', 'Limerick'),
 (20, 'Richard Foley', 'Offaly'),
 (21, 'Billy King', 'Louth'),
 (22, 'Christopher Mcmahon', 'Limerick'),
 (23, 'Gregory Vazquez', 'Sligo'),
 (24, 'George Fitzgerald', 'Carlow'),
 (25, 'Joshua Perez', 'Galway'),
 (26, 'Leonard Brown', 'Sligo'),
 (27, 'Anne Anderson', 'Cork'),
 (28, 'Marc Chapman', 'Dublin'),
 (29, 'Connie Walls', 'Limerick'),
 (30, 'Seth Simpson', 'Westmeath'),
 (31, 'Laura Miller', 'Louth'),
 (32, 'William Hall', 'Kerry'),
 (33, 'Katherine Dalton', 'Kildare'),
 (34, 'Alan Williams', 'Galway'),
 (35, 'Diane Hunt', 'Westmeath'),
 (36, 'Lauren Long', 'Louth'),
 (37, 'James Williams', 'Kilkenny'),
 (38, 'Jeremiah Soto', 'Sligo'),
 (39, 'Gregory Charles', 'Wicklow'),
 (40, 'Raymond Gould', 'Clare'),
 (41, 'Susan Cummings', 'Cork'),
 (42, 'Megan Reyes', 'Offaly'),
 (43, 'Devin Shaw', 'Wexford'),
 (44, 'Kathleen Henderson', 'Monaghan'),
 (45, 'John Davis', 'Dublin'),
 (46, 'Melanie White', 'Carlow'),
 (47, 'Kerry Curry', 'Galway'),
 (48, 'Nathan Smith', 'Roscommon'),
 (49, 'Sara Lee', 'Laois'),
 (50, 'Valerie Rodriguez', 'Kerry'),
 (51, 'Raymond Perkins', 'Clare'),
 (52, 'David Matthews', 'Leitrim'),
 (53, 'Lori Harmon', 'Carlow'),
 (54, 'Kayla Rodriguez DVM', 'Clare'),
 (55, 'Alan Cabrera', 'Leitrim'),
 (56, 'Elizabeth Harper', 'Donegal'),
 (57, 'Glenn Gonzalez', 'Leitrim'),
 (58, 'Robert Price', 'Dublin'),
 (59, 'Tina Holland', 'Sligo'),
 (60, 'Melinda Blackwell', 'Mayo'),
 (61, 'Christina Bautista', 'Longford'),
 (62, 'Scott Whitaker', 'Offaly'),
 (63, 'Jeff Stevens', 'Dublin'),
 (64, 'Robert Acevedo', 'Meath'),
 (65, 'Tracey Olson', 'Kilkenny'),
 (66, 'James Walker', 'Tipperary'),
 (67, 'Jennifer Sutton', 'Mayo'),
 (68, 'Nicholas Carrillo', 'Laois'),
 (69, 'Emily Cooper', 'Kildare'),
 (70, 'Sabrina Thompson', 'Longford'),
 (71, 'Jenny Juarez', 'Longford'),
 (72, 'Melissa Lowe', 'Westmeath'),
 (73, 'Jesse Chavez', 'Meath'),
 (74, 'Kelly Walker', 'Kildare'),
 (75, 'Leonard Chen', 'Galway'),
 (76, 'Peter Vaughn DDS', 'Cork'),
 (77, 'Justin Casey', 'Louth'),
 (78, 'Shannon Oneal', 'Sligo'),
 (79, 'Robert Fields', 'Louth'),
 (80, 'Marcus Malone', 'Kildare'),
 (81, 'Paul Nicholson', 'Wexford'),
 (82, 'Jared Nguyen', 'Cavan'),
 (83, 'Mrs. Sheila Wilkerson', 'Tipperary'),
 (84, 'Emily Alvarado', 'Longford'),
 (85, 'Christopher Miller', 'Kerry'),
 (86, 'Carrie Sullivan', 'Galway'),
 (87, 'Jordan Velasquez', 'Galway'),
 (88, 'Melissa Bell', 'Kildare'),
 (89, 'Frederick Schwartz', 'Dublin'),
 (90, 'Stephanie Yates', 'Meath'),
 (91, 'Lori Martin', 'Westmeath'),
 (92, 'Donna Mason', 'Longford'),
 (93, 'Rachel Johnson', 'Kildare'),
 (94, 'Morgan Marsh', 'Westmeath'),
 (95, 'Daniel Smith', 'Limerick'),
 (96, 'Joseph Griffith', 'Wicklow'),
 (97, 'Stephen Oneal', 'Louth'),
 (98, 'Dana Wade', 'Mayo'),
 (99, 'Gail Jones', 'Waterford'),
 (100, 'Paul Raymond', 'Louth')]

### Drop Table

In [17]:
c.execute("DROP TABLE person")
conn.commit()

### Turning csv files in tables in a Database

In [18]:
import pandas as pd
person = pd.read_csv("https://raw.githubusercontent.com/ianmcloughlin/datasets/master/cars-db/person.csv", index_col=0)
person.head(10)

                   Name    Address
ID
0            Anna Henry     Carlow
1           Shelby Beck  Tipperary
2            Marie Carr      Kerry
3           Sarah Heath   Monaghan
4         Robert Snyder    Leitrim
5            Lucas Ross       Cork
6             David Cox    Leitrim
7          Jackson Dean      Louth
8   Elizabeth Mcfarland     Dublin
9      Timothy Cummings   Limerick

In [19]:
person.to_sql("person", conn)

In [20]:
c.execute("SELECT * FROM person")
c.fetchall()

[(0, 'Anna Henry', 'Carlow'),
 (1, 'Shelby Beck', 'Tipperary'),
 (2, 'Marie Carr', 'Kerry'),
 (3, 'Sarah Heath', 'Monaghan'),
 (4, 'Robert Snyder', 'Leitrim'),
 (5, 'Lucas Ross', 'Cork'),
 (6, 'David Cox', 'Leitrim'),
 (7, 'Jackson Dean', 'Louth'),
 (8, 'Elizabeth Mcfarland', 'Dublin'),
 (9, 'Timothy Cummings', 'Limerick'),
 (10, 'Jennifer Reeves', 'Offaly'),
 (11, 'Sandra Knight', 'Offaly'),
 (12, 'Karen Roach', 'Sligo'),
 (13, 'Megan Clarke', 'Kildare'),
 (14, 'Hannah Collier', 'Leitrim'),
 (15, 'Crystal Murphy', 'Clare'),
 (16, 'Jacob Moore', 'Longford'),
 (17, 'Valerie Stewart', 'Longford'),
 (18, 'Mrs. Kerry Romero', 'Limerick'),
 (19, 'Richard Foley', 'Offaly'),
 (20, 'Billy King', 'Louth'),
 (21, 'Christopher Mcmahon', 'Limerick'),
 (22, 'Gregory Vazquez', 'Sligo'),
 (23, 'George Fitzgerald', 'Carlow'),
 (24, 'Joshua Perez', 'Galway'),
 (25, 'Leonard Brown', 'Sligo'),
 (26, 'Anne Anderson', 'Cork'),
 (27, 'Marc Chapman', 'Dublin'),
 (28, 'Connie Walls', 'Limerick'),
 (29, 'Seth Simpson', 'Westmeath'),
 (30, 'Laura Miller', 'Louth'),
 (31, 'William Hall', 'Kerry'),
 (32, 'Katherine Dalton', 'Kildare'),
 (33, 'Alan Williams', 'Galway'),
 (34, 'Diane Hunt', 'Westmeath'),
 (35, 'Lauren Long', 'Louth'),
 (36, 'James Williams', 'Kilkenny'),
 (37, 'Jeremiah Soto', 'Sligo'),
 (38, 'Gregory Charles', 'Wicklow'),
 (39, 'Raymond Gould', 'Clare'),
 (40, 'Susan Cummings', 'Cork'),
 (41, 'Megan Reyes', 'Offaly'),
 (42, 'Devin Shaw', 'Wexford'),
 (43, 'Kathleen Henderson', 'Monaghan'),
 (44, 'John Davis', 'Dublin'),
 (45, 'Melanie White', 'Carlow'),
 (46, 'Kerry Curry', 'Galway'),
 (47, 'Nathan Smith', 'Roscommon'),
 (48, 'Sara Lee', 'Laois'),
 (49, 'Valerie Rodriguez', 'Kerry'),
 (50, 'Raymond Perkins', 'Clare'),
 (51, 'David Matthews', 'Leitrim'),
 (52, 'Lori Harmon', 'Carlow'),
 (53, 'Kayla Rodriguez DVM', 'Clare'),
 (54, 'Alan Cabrera', 'Leitrim'),
 (55, 'Elizabeth Harper', 'Donegal'),
 (56, 'Glenn Gonzalez', 'Leitrim'),
 (57, 'Robert Price', 'Dublin'),
 (58, 'Tina Holland', 'Sligo'),
 (59, 'Melinda Blackwell', 'Mayo'),
 (60, 'Christina Bautista', 'Longford'),
 (61, 'Scott Whitaker', 'Offaly'),
 (62, 'Jeff Stevens', 'Dublin'),
 (63, 'Robert Acevedo', 'Meath'),
 (64, 'Tracey Olson', 'Kilkenny'),
 (65, 'James Walker', 'Tipperary'),
 (66, 'Jennifer Sutton', 'Mayo'),
 (67, 'Nicholas Carrillo', 'Laois'),
 (68, 'Emily Cooper', 'Kildare'),
 (69, 'Sabrina Thompson', 'Longford'),
 (70, 'Jenny Juarez', 'Longford'),
 (71, 'Melissa Lowe', 'Westmeath'),
 (72, 'Jesse Chavez', 'Meath'),
 (73, 'Kelly Walker', 'Kildare'),
 (74, 'Leonard Chen', 'Galway'),
 (75, 'Peter Vaughn DDS', 'Cork'),
 (76, 'Justin Casey', 'Louth'),
 (77, 'Shannon Oneal', 'Sligo'),
 (78, 'Robert Fields', 'Louth'),
 (79, 'Marcus Malone', 'Kildare'),
 (80, 'Paul Nicholson', 'Wexford'),
 (81, 'Jared Nguyen', 'Cavan'),
 (82, 'Mrs. Sheila Wilkerson', 'Tipperary'),
 (83, 'Emily Alvarado', 'Longford'),
 (84, 'Christopher Miller', 'Kerry'),
 (85, 'Carrie Sullivan', 'Galway'),
 (86, 'Jordan Velasquez', 'Galway'),
 (87, 'Melissa Bell', 'Kildare'),
 (88, 'Frederick Schwartz', 'Dublin'),
 (89, 'Stephanie Yates', 'Meath'),
 (90, 'Lori Martin', 'Westmeath'),
 (91, 'Donna Mason', 'Longford'),
 (92, 'Rachel Johnson', 'Kildare'),
 (93, 'Morgan Marsh', 'Westmeath'),
 (94, 'Daniel Smith', 'Limerick'),
 (95, 'Joseph Griffith', 'Wicklow'),
 (96, 'Stephen Oneal', 'Louth'),
 (97, 'Dana Wade', 'Mayo'),
 (98, 'Gail Jones', 'Waterford'),
 (99, 'Paul Raymond', 'Louth')]

In [21]:
car = pd.read_csv("https://raw.githubusercontent.com/ianmcloughlin/datasets/master/cars-db/car.csv", index_col=0)
car.head(10)

   Registration  OwnerId
ID
0   08-SO-11072        9
1   16-KE-16368       97
2   08-LD-16871       17
3   11-KY-17442       22
4   16-LD-17545       48
5    10-WH-3543       10
6    03-KE-8148       74
7    06-G-23024        4
8   08-LS-21770       93
9   03-WX-41717       53

In [24]:
car.to_sql("car", conn)

ValueError: Table 'car' already exists.

In [25]:
c.execute("SELECT * FROM car")
c.fetchall()

[(0, '08-SO-11072', 9),
 (1, '16-KE-16368', 97),
 (2, '08-LD-16871', 17),
 (3, '11-KY-17442', 22),
 (4, '16-LD-17545', 48),
 (5, '10-WH-3543', 10),
 (6, '03-KE-8148', 74),
 (7, '06-G-23024', 4),
 (8, '08-LS-21770', 93),
 (9, '03-WX-41717', 53),
 (10, '01-T-37495', 63),
 (11, '11-WH-22446', 40),
 (12, '09-MN-43311', 26),
 (13, '05-KK-2596', 0),
 (14, '17-SO-17328', 45),
 (15, '99-L-23440', 76),
 (16, '05-WX-31122', 16),
 (17, '16-LS-41756', 91),
 (18, '16-RN-45098', 25),
 (19, '16-C-27251', 80),
 (20, '06-LD-43721', 89),
 (21, '03-RN-2898', 28),
 (22, '10-CW-49121', 58),
 (23, '15-LS-45283', 67),
 (24, '08-D-43986', 0),
 (25, '08-DL-49460', 42),
 (26, '08-DL-20130', 59),
 (27, '10-WX-18691', 4),
 (28, '08-T-37917', 2),
 (29, '15-D-6469', 6),
 (30, '08-L-26251', 19),
 (31, '15-DL-15311', 54),
 (32, '14-KE-41007', 79),
 (33, '14-DL-12858', 89),
 (34, '04-WH-36658', 34),
 (35, '00-MO-9632', 18),
 (36, '99-RN-41288', 43),
 (37, '13-MO-7316', 18),
 (38, '00-MH-17952', 38),
 (39, '18-LM-29466', 36),
 (40, '08-D-18591', 23),
 (41, '01-KK-27583', 89),
 (42, '13-T-24765', 20),
 (43, '01-RN-44780', 31),
 (44, '04-LD-24948', 25),
 (45, '13-SO-2521', 49),
 (46, '16-WH-32130', 25),
 (47, '13-KE-37707', 11),
 (48, '99-CN-35366', 82),
 (49, '18-CN-17743', 27),
 (50, '05-LS-6602', 33),
 (51, '02-T-2683', 91),
 (52, '06-LD-44064', 11),
 (53, '14-SO-35322', 28),
 (54, '00-MH-30641', 3),
 (55, '17-MH-38452', 12),
 (56, '01-KY-40015', 1),
 (57, '13-G-17426', 30),
 (58, '03-LM-41543', 78),
 (59, '00-LH-46635', 18),
 (60, '09-SO-26131', 97),
 (61, '00-OY-15049', 56),
 (62, '12-G-20496', 72),
 (63, '04-RN-2959', 59),
 (64, '07-KY-17472', 1),
 (65, '03-KY-23864', 65),
 (66, '03-CW-12234', 57),
 (67, '04-LS-17699', 49),
 (68, '12-MO-21340', 59),
 (69, '14-WW-26729', 50),
 (70, '08-KK-6963', 28),
 (71, '03-D-36946', 61),
 (72, '03-WX-39739', 15),
 (73, '15-MO-29166', 9),
 (74, '09-LM-6757', 53),
 (75, '99-LD-27879', 2),
 (76, '16-WX-38806', 50),
 (77, '06-KE-13830', 67),
 (78, '00-OY-18653', 83),
 (79, '09-G-14895', 18),
 (80, '06-LH-39166', 61),
 (81, '10-MO-45154', 93),
 (82, '04-WH-37901', 55),
 (83, '13-DL-46087', 96),
 (84, '14-CN-12576', 76),
 (85, '15-D-4470', 88),
 (86, '00-MO-32274', 21),
 (87, '15-WH-21313', 80),
 (88, '08-D-29496', 59),
 (89, '00-LD-24730', 75),
 (90, '14-OY-15669', 38),
 (91, '00-MO-6904', 75),
 (92, '17-DL-4885', 5),
 (93, '05-MN-17446', 70),
 (94, '04-L-19474', 86),
 (95, '99-WW-237', 33),
 (96, '03-G-36241', 46),
 (97, '09-W-11201', 3),
 (98, '13-MO-34031', 63),
 (99, '02-KK-25507', 58),
 (100, '08-LH-46637', 92),
 (101, '12-KY-47631', 80),
 (102, '01-SO-45136', 66),
 (103, '18-WH-15349', 37),
 (104, '14-MO-11345', 37),
 (105, '13-CE-10371', 30),
 (106, '17-KE-21153', 88),
 (107, '12-G-30288', 92),
 (108, '13-T-20412', 16),
 (109, '08-LS-13835', 5),
 (110, '12-CW-37691', 42),
 (111, '00-KY-48702', 3),
 (112, '14-LD-41919', 28),
 (113, '18-W-16094', 30),
 (114, '11-MH-39456', 16),
 (115, '01-KK-21586', 92),
 (116, '09-WX-7243', 11),
 (117, '12-WX-26308', 13),
 (118, '02-LS-42993', 58),
 (119, '18-W-44751', 67),
 (120, '11-L-45810', 74),
 (121, '12-MH-7025', 50),
 (122, '09-CW-13802', 34),
 (123, '11-KK-40419', 67),
 (124, '09-MO-27719', 28),
 (125, '99-RN-21293', 92),
 (126, '06-KK-24445', 39),
 (127, '99-DL-44188', 97),
 (128, '17-CW-12306', 5),
 (129, '12-WH-30512', 45),
 (130, '13-CW-22728', 91),
 (131, '15-G-27780', 86),
 (132, '99-WX-37648', 93),
 (133, '07-G-30931', 32),
 (134, '08-G-34713', 18),
 (135, '03-MO-23757', 75),
 (136, '09-LD-32395', 93),
 (137, '05-KE-47018', 91),
 (138, '18-RN-21403', 40),
 (139, '02-LH-37988', 99),
 (140, '11-T-29849', 43),
 (141, '99-MN-36507', 33),
 (142, '15-SO-10080', 38),
 (143, '10-KE-5471', 49),
 (144, '09-C-15081', 40),
 (145, '12-D-10674', 1),
 (146, '16-KK-6777', 62),
 (147, '09-KY-24502', 47),
 (148, '06-L-13615', 62),
 (149, '11-WX-6607', 79),
 (150, '99-KY-44876', 72),
 (151, '01-KE-7495', 40),
 (152, '06-WH-45961', 76),
 (153, '13-RN-48840', 77),
 (154, '15-LS-32504', 87),
 (155, '09-KK-33938', 53),
 (156, '15-SO-48732', 25),
 (157, '18-LH-9276', 58),
 (158, '00-T-13145', 10),
 (159, '17-L-8077', 91),
 (160, '16-KY-38486', 50),
 (161, '13-C-5004', 43),
 (162, '13-KE-8122', 69),
 (163, '13-D-16232', 8),
 (164, '07-OY-29590', 64),
 (165, '18-LS-3902', 44),
 (166, '07-LD-25411', 60),
 (167, '11-OY-49718', 29),
 (168, '09-OY-12095', 68),
 (169, '10-RN-14168', 83),
 (170, '00-CN-12132', 70),
 (171, '14-G-24691', 75),
 (172, '08-L-9335', 28),
 (173, '13-LS-7544', 18),
 (174, '15-RN-47108', 11),
 (175, '16-RN-12605', 42),
 (176, '15-WX-13974', 70),
 (177, '00-T-26883', 33),
 (178, '01-C-1695', 85),
 (179, '11-WW-3780', 33),
 (180, '06-CW-29425', 58),
 (181, '04-MN-1637', 30),
 (182, '14-OY-39752', 50),
 (183, '15-MO-15513', 76),
 (184, '16-MN-22976', 57),
 (185, '07-OY-14928', 84),
 (186, '09-L-10881', 22),
 (187, '99-WX-23085', 94),
 (188, '01-DL-25359', 49),
 (189, '00-MO-45664', 55),
 (190, '08-WW-30636', 94),
 (191, '01-CN-16097', 13),
 (192, '07-LM-3132', 58),
 (193, '09-T-9813', 27),
 (194, '16-KK-30424', 0),
 (195, '99-CE-38547', 72),
 (196, '10-LM-31279', 3),
 (197, '18-LH-44089', 80),
 (198, '02-SO-11359', 51),
 (199, '10-KE-33674', 8),
 (200, '15-KE-8245', 23),
 (201, '09-KK-23170', 50),
 (202, '14-CN-36381', 21),
 (203, '00-C-29416', 60),
 (204, '10-OY-1992', 21),
 (205, '10-T-36797', 51),
 (206, '07-KY-35080', 92),
 (207, '08-MO-42969', 98),
 (208, '07-OY-23008', 62),
 (209, '14-MO-46320', 95),
 (210, '09-CW-29560', 32),
 (211, '03-MH-49587', 42),
 (212, '10-MH-34061', 99),
 (213, '08-OY-35517', 5),
 (214, '04-KY-47667', 75),
 (215, '03-C-18358', 22),
 (216, '11-DL-2662', 79),
 (217, '06-CW-15872', 98),
 (218, '08-KE-7824', 70),
 (219, '14-WH-21137', 69),
 (220, '11-W-6130', 43),
 (221, '03-C-4508', 39),
 (222, '02-CN-35760', 8),
 (223, '13-C-5330', 13),
 (224, '07-CN-40170', 76),
 (225, '07-CW-32094', 49),
 (226, '13-CW-22639', 33),
 (227, '10-LD-39262', 33),
 (228, '14-CE-46501', 89),
 (229, '16-WW-18559', 40),
 (230, '11-LD-42457', 84),
 (231, '02-W-35723', 77),
 (232, '13-RN-4833', 58),
 (233, '01-KK-12540', 12),
 (234, '14-CN-39530', 30),
 (235, '08-T-1665', 85),
 (236, '13-LH-30593', 88),
 (237, '06-C-24008', 85),
 (238, '12-LH-5689', 13),
 (239, '05-WW-47977', 74),
 (240, '09-KK-5328', 40),
 (241, '10-DL-6386', 2),
 (242, '05-MH-22339', 44),
 (243, '02-MH-44541', 7),
 (244, '18-MN-26444', 72),
 (245, '12-LM-22338', 38),
 (246, '18-KY-29981', 42),
 (247, '01-G-8684', 30),
 (248, '04-KY-32797', 27),
 (249, '08-LD-12240', 80),
 (250, '18-WW-11514', 91),
 (251, '03-L-40377', 97),
 (252, '15-G-37225', 70),
 (253, '14-CN-41515', 83),
 (254, '09-LS-131', 78),
 (255, '12-LS-47102', 6),
 (256, '15-WX-8189', 54),
 (257, '13-CW-21688', 91),
 (258, '15-DL-3247', 44),
 (259, '02-D-22267', 50),
 (260, '01-LS-33323', 63),
 (261, '10-WH-9955', 75),
 (262, '03-MO-4365', 95),
 (263, '04-LD-23688', 95),
 (264, '13-G-16885', 33),
 (265, '18-KE-36389', 70),
 (266, '01-T-15866', 71),
 (267, '08-KE-16056', 84),
 (268, '13-G-24475', 53),
 (269, '03-MO-25665', 68),
 (270, '18-T-2425', 89),
 (271, '04-WW-24305', 55),
 (272, '13-OY-23701', 77),
 (273, '08-MO-46007', 51),
 (274, '00-L-47267', 57),
 (275, '08-KK-47849', 68),
 (276, '16-MN-41115', 55),
 (277, '02-DL-7526', 97),
 (278, '01-G-15863', 45),
 (279, '14-SO-6402', 55),
 (280, '02-CN-7196', 52),
 (281, '01-CW-35670', 21),
 (282, '16-T-45794', 11),
 (283, '03-KK-1616', 0),
 (284, '08-WX-43305', 10),
 (285, '15-W-31836', 82),
 (286, '03-KE-1400', 40),
 (287, '08-WW-22857', 81),
 (288, '15-L-48040', 55),
 (289, '05-CN-49186', 89),
 (290, '18-T-43669', 64),
 (291, '05-WX-40194', 44),
 (292, '08-LH-30886', 0),
 (293, '07-G-36331', 45),
 (294, '06-WW-48865', 74),
 (295, '16-MO-40801', 25),
 (296, '15-L-37732', 23),
 (297, '10-G-21752', 98),
 (298, '08-C-34297', 40),
 (299, '17-SO-23443', 16),
 (300, '05-CN-5924', 97),
 (301, '05-W-22770', 6),
 (302, '10-LH-34050', 24),
 (303, '16-LS-26245', 78),
 (304, '05-D-30917', 14),
 (305, '07-G-48955', 97),
 (306, '13-G-48846', 34),
 (307, '05-L-42386', 13),
 (308, '08-T-12971', 19),
 (309, '18-WH-6082', 85),
 (310, '12-MO-30235', 94),
 (311, '16-T-22243', 44),
 (312, '03-L-37130', 62),
 (313, '12-MO-18353', 42),
 (314, '11-MN-11186', 78),
 (315, '05-WX-40062', 57),
 (316, '04-D-38409', 71),
 (317, '16-CE-29807', 31),
 (318, '15-D-4632', 95),
 (319, '14-LM-31240', 24),
 (320, '15-LH-20280', 6),
 (321, '04-L-14265', 62),
 (322, '05-KK-13066', 11),
 (323, '02-MN-14407', 86),
 (324, '11-CE-42446', 81),
 (325, '16-W-29168', 71),
 (326, '03-G-19542', 32),
 (327, '18-MO-35400', 14),
 (328, '11-KK-35894', 33),
 (329, '07-G-5958', 29)]

In [26]:
county = pd.read_csv("https://raw.githubusercontent.com/ianmcloughlin/datasets/master/cars-db/county.csv", index_col=0)
county.to_sql("county", conn)
c.execute("SELECT * FROM county")
c.fetchall()

[(0, 'CW', 'Carlow'),
 (1, 'CN', 'Cavan'),
 (2, 'CE', 'Clare'),
 (3, 'C', 'Cork'),
 (4, 'DL', 'Donegal'),
 (5, 'D', 'Dublin'),
 (6, 'G', 'Galway'),
 (7, 'KY', 'Kerry'),
 (8, 'KE', 'Kildare'),
 (9, 'KK', 'Kilkenny'),
 (10, 'LS', 'Laois'),
 (11, 'LM', 'Leitrim'),
 (12, 'L', 'Limerick'),
 (13, 'LD', 'Longford'),
 (14, 'LH', 'Louth'),
 (15, 'MO', 'Mayo'),
 (16, 'MH', 'Meath'),
 (17, 'MN', 'Monaghan'),
 (18, 'OY', 'Offaly'),
 (19, 'RN', 'Roscommon'),
 (20, 'SO', 'Sligo'),
 (21, 'T', 'Tipperary'),
 (22, 'W', 'Waterford'),
 (23, 'WH', 'Westmeath'),
 (24, 'WX', 'Wexford'),
 (25, 'WW', 'Wicklow')]

In [27]:
c.execute("SELECT * FROM sqlite_master where type='table'")
c.fetchall()

[('table',
  'person',
  'person',
  2,
  'CREATE TABLE "person" (\n"ID" INTEGER,\n  "Name" TEXT,\n  "Address" TEXT\n)'),
 ('table',
  'car',
  'car',
  4,
  'CREATE TABLE "car" (\n"ID" INTEGER,\n  "Registration" TEXT,\n  "OwnerId" INTEGER\n)'),
 ('table',
  'county',
  'county',
  8,
  'CREATE TABLE "county" (\n"ID" INTEGER,\n  "Registration" TEXT,\n  "Name" TEXT\n)')]